import csv
from faker import Faker
from datetime import datetime, date, time, timedelta
import random
from dateutil.relativedelta import relativedelta


names_list = [
    [["佐藤 健一"], ["サトウ ケンイチ"]],
    [["鈴木 花子"], ["スズキ ハナコ"]],
    [["高橋 太郎"], ["タカハシ タロウ"]],
    [["田中 美咲"], ["タナカ ミサキ"]],
    [["伊藤 翔"], ["イトウ ショウ"]],
    [["渡辺 結衣"], ["ワタナベ ユイ"]],
    [["山本 裕太"], ["ヤマモト ユウタ"]],
    [["中村 咲良"], ["ナカムラ サクラ"]],
    [["小林 優子"], ["コバヤシ ユウコ"]],
    [["加藤 大輝"], ["カトウ ヒロキ"]],
    [["吉田 梨沙"], ["ヨシダ リサ"]],
    [["山田 拓真"], ["ヤマダ タクマ"]],
    [["佐々木 麻美"], ["ササキ アサミ"]],
    [["清水 翔子"], ["シミズ ショウコ"]],
    [["松本 涼介"], ["マツモト リョウスケ"]],
    [["井上 美紀"], ["イノウエ ミキ"]],
    [["木村 隆"], ["キムラ タカシ"]],
    [["林 萌絵"], ["ハヤシ モエ"]],
    [["斎藤 雅樹"], ["サイトウ マサキ"]],
    [["池田 実乃里"], ["イケダ ミノリ"]],
    [["阿部 和也"], ["アベ カズヤ"]],
    [["森 優奈"], ["モリ ユウナ"]],
    [["橋本 陽介"], ["ハシモト ヨウスケ"]],
    [["石井 菜々子"], ["イシイ ナナコ"]],
    [["前田 健太"], ["マエダ ケンタ"]],
    [["藤田 真理子"], ["フジタ マリコ"]],
    [["岡田 亮"], ["オカダ リョウ"]],
    [["原田 奈々美"], ["ハラダ ナナミ"]],
    [["中野 拓哉"], ["ナカノ タクヤ"]],
    [["石川 由美"], ["イシカワ ユミ"]],
    [["小川 直樹"], ["オガワ ナオキ"]],
    [["松田 美和"], ["マツダ ミワ"]],
    [["岩田 紗季"], ["イワタ サキ"]],
    [["福田 孝之"], ["フクダ タカユキ"]],
    [["西村 友里"], ["ニシムラ ユリ"]],
    [["川口 凌太"], ["カワグチ リョウタ"]],
    [["大野 奈央"], ["オオノ ナオ"]],
    [["杉山 修平"], ["スギヤマ シュウヘイ"]],
    [["宮本 萌子"], ["ミヤモト モエコ"]],
    [["長谷川 誠"], ["ハセガワ マコト"]],
    [["村上 佳奈"], ["ムラカミ カナ"]],
    [["青木 拓人"], ["アオキ タクト"]],
    [["坂本 彩香"], ["サカモト アヤカ"]],
    [["武田 慶太"], ["タケダ ケイタ"]],
    [["藤井 彩奈"], ["フジイ アヤナ"]],
    [["後藤 大智"], ["ゴトウ ダイチ"]],
    [["三浦 直子"], ["ミウラ ナオコ"]],
    [["山下 朋子"], ["ヤマシタ トモコ"]],
    [["河野 陽太"], ["コウノ ヨウタ"]],
    [["横山 裕子"], ["ヨコヤマ ユウコ"]],
    [["北村 圭介"], ["キタムラ ケイスケ"]],
    [["永井 美佳"], ["ナガイ ミカ"]],
    [["中川 直美"], ["ナカガワ ナオミ"]],
    [["安田 亮介"], ["ヤスダ リョウスケ"]],
    [["野村 華奈"], ["ノムラ カナ"]],
    [["松井 蓮"], ["マツイ レン"]],
    [["平野 陽菜"], ["ヒラノ ヒナ"]],
    [["金子 晃"], ["カネコ アキラ"]],
    [["松浦 梨沙子"], ["マツウラ リサコ"]],
    [["和田 誠二"], ["ワダ セイジ"]],
    [["今井 美咲"], ["イマイ ミサキ"]],
    [["堀江 大樹"], ["ホリエ ダイジュ"]],
    [["田村 佑介"], ["タムラ ユウスケ"]],
    [["藤本 佳奈美"], ["フジモト カナミ"]],
    [["白石 美幸"], ["シライシ ミユキ"]],
    [["菅原 翔太"], ["スガワラ ショウタ"]],
    [["黒田 恵美"], ["クロダ エミ"]],
    [["田辺 直樹"], ["タナベ ナオキ"]],
    [["岡本 奈々子"], ["オカモト ナナコ"]],
    [["篠原 聡太"], ["シノハラ ソウタ"]],
    [["中西 咲希"], ["ナカニシ サキ"]],
    [["石田 大輝"], ["イシダ ダイキ"]],
    [["野田 智子"], ["ノダ トモコ"]],
    [["原 恭子"], ["ハラ キョウコ"]],
    [["増田 真一"], ["マスダ シンイチ"]],
    [["川村 麻衣"], ["カワムラ マイ"]],
    [["柴田 大樹"], ["シバタ ダイキ"]],
    [["長田 健太"], ["ナガタ ケンタ"]],
    [["秋山 華子"], ["アキヤマ ハナコ"]],
    [["栗原 涼太"], ["クリハラ リョウタ"]],
    [["本田 美保"], ["ホンダ ミホ"]],
    [["矢野 智也"], ["ヤノ トモヤ"]],
    [["大久保 恵子"], ["オオクボ ケイコ"]],
    [["福島 陽介"], ["フクシマ ヨウスケ"]],
    [["松井 祐樹"], ["マツイ ユウキ"]],
    [["大西 咲良"], ["オオニシ サクラ"]],
    [["星野 翔太"], ["ホシノ ショウタ"]],
    [["横田 真理子"], ["ヨコタ マリコ"]],
    [["宮崎 優子"], ["ミヤザキ ユウコ"]],
    [["吉川 翔子"], ["ヨシカワ ショウコ"]],
    [["小島 拓也"], ["コジマ タクヤ"]],
    [["浜田 美里"], ["ハマダ ミサト"]],
    [["石原 隆"], ["イシハラ タカシ"]],
    [["長谷 智恵"], ["ハセ チエ"]],
    [["酒井 美希"], ["サカイ ミキ"]],
    [["大塚 拓郎"], ["オオツカ タクロウ"]],
    [["小倉 萌絵"], ["オグラ モエ"]],
    [["北川 一郎"], ["キタガワ イチロウ"]],
    [["本間 咲子"], ["ホンマ サキコ"]],
    [["村田 奈央"], ["ムラタ ナオ"]],
    [["高木 弘樹"], ["タカギ ヒロキ"]],
    [["広瀬 亜美"], ["ヒロセ アミ"]],
    [["川端 涼介"], ["カワバタ リョウスケ"]],
    [["上田 慎太郎"], ["ウエダ シンタロウ"]]
]

nicknames_list = [
    "サンダー", "スカイ", "ライト", "シャドウ", "ミスト", "ファントム", "ストーム", "グリッド", "クラウド", "フラッシュ",
    "フロスト", "スパーク", "フレア", "ブレイズ", "レイ", "カーム", "ウィング", "スコープ", "ファルコン", "シェード",
    "ワイルド", "クエスト", "サージ", "スラッシュ", "ホープ", "ピュア", "スパイク", "ギャラクシー", "ベース", "コア",
    "ドリフト", "ネクサス", "グロー", "ヴォルテックス", "サイレント", "ハーモニー", "エコー", "トレイル", "リーフ", "ブリッジ",
    "エクスプレス", "ターボ", "アクセル", "フェニックス", "シルク", "ウィスパー", "グレース", "ブリーズ", "エクストリーム", "ブリンク",
    "アトラス", "ホライズン", "ブルーム", "オーロラ", "オーシャン", "バニッシュ", "プライム", "サブゼロ", "インパクト", "グレイシャー",
    "エース", "ラピッド", "サブウェイ", "ランナー", "スナイパー", "クロス", "クリア", "ノート", "エピック", "オメガ",
    "トリガー", "リズム", "ドーン", "ダーク", "パルス", "ヴェール", "ディープ", "ビート", "プラズマ", "パラドックス",
    "サージャー", "グライド", "アルファ", "フィクション", "グリップ", "ピクセル", "ヴォイド", "プラネット", "クレスト", "フォース",
    "アーク", "サブウェーブ", "アーバン", "ヴァイブ", "クルーズ", "スター", "バレル", "ルート", "ファスト", "ストライク",
    "グラビティ", "マグナ", "ドリーム", "グランド", "ノヴァ", "コスモス", "ボルト", "ウィッシュ", "カオス", "リフト",
    "レジェンド", "メタル", "ポータル", "ドローン", "カーボン", "シフト", "ネオン", "ゼロ", "エクシード", "プロト",
    "リバース", "スペクトル", "プログレス", "ステルス", "レゾナンス", "ハイパー", "クレア", "レゾリューション", "モーション", "ステージ",
    "サンダーストーム", "ディセント", "レーダー", "マイティ", "サンダーボルト", "サイバー", "クラッシュ", "ベクター", "モーメント", "エレメント",
    "テンペスト", "ブロック", "グロウ", "ピース", "サイフォン", "クエイザー", "フリーダム", "ドライブ", "アサルト", "カーム",
    "スタイル", "ソニック", "グライダー", "パワー", "ウィンダム", "ミラージュ", "サイレンサー", "スパークル", "フレッシュ", "ラッシュ",
    "グロリアス", "フュージョン", "アース", "スティル", "フェザー", "エターナル", "メロウ", "トゥルース", "フレイム", "ライトニング",
    "サン", "シンプル", "リズム", "オール", "スピード", "ワンダー", "ライトウェイ", "フライ", "ネビュラ", "ボヤージュ",
    "グローバル", "エイム", "チャージ", "ソル", "ルミナス", "ヴァース", "ロケット", "フロウ", "アーチ", "シグナル",
    "ディメンション", "エクシス", "オブシディアン", "バリア", "グルーヴ", "ラグーン", "ネクスト", "ストーリー", "モード", "ライザー",
    "アクシス", "ウィン", "フリック", "フォーカス", "エネルギー", "リミット", "ネクタル", "アステラ", "ヴェロシティ", "エナジー"
]

def getRandamDay():
    min_year=2019
    dtMax = datetime.now()
    max_year=int(dtMax.strftime('%Y'))

    start = datetime.datetime(min_year, 1, 1, 00, 00, 00)
    years = max_year - min_year + 1
    end = start + datetime.timedelta(days=1 * years)
    dt = start + (end - start) * random.random()
    print(dt.strftime('%Y-%m-%d'))
    return dt.strftime('%Y-%m-%d')

for i in range(100):
    row = []
    row.append('')
    row.append(names_list[i][0])
    row.append(names_list[i][1])
    row.append(getRandamDay())
    row.append(random.choice(times))
    row.append(random.randint(1, 20))
    row.append(datetime.now())
    row.append(datetime.now())
    row.append(random.choice(restaurant_ids))
    row.append(random.choice(user_ids))
    rows.append(row)

with open('reservation.csv', 'w') as f:
    writer = csv.writer(f)
    writer.writerows(rows)

f.close()